Tekla Open API Reference for Tekla Structures 2025
PrinterItemEnumerator Properties
The PrinterItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a printer item instance of the current element.
Top
See Also
Reference
PrinterItemEnumerator Class
Tekla.Structures.Catalogs Namespace